#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/hamersmith/gh-actions-demo/runs/run-EyExz5yWjZBEaggJ

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
snowflake_database.demo_db: Refreshing state... [id=DEMO_DB]
snowflake_schema.demo_schema: Refreshing state... [id=DEMO_DB|DEMO_SCHEMA]
snowflake_schema.nigel_schema: Refreshing state... [id=DEMO_DB|NIGEL_SCHEMA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_warehouse.demo_wh will be created
  + resource "snowflake_warehouse" "demo_wh" {
      + auto_resume                         = (known after apply)
      + auto_suspend                        = (known after apply)
      + comment                             = "Warehouse for Snowflake Terraform demo"
      + id                                  = (known after apply)
      + max_cluster_count                   = (known after apply)
      + max_concurrency_level               = 0
      + min_cluster_count                   = (known after apply)
      + name                                = "DEMO_WH"
      + resource_monitor                    = (known after apply)
      + scaling_policy                      = (known after apply)
      + statement_queued_timeout_in_seconds = 0
      + statement_timeout_in_seconds        = 0
      + warehouse_size                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_PASSWORD" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-EyExz5yWjZBEaggJ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_REGION" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-EyExz5yWjZBEaggJ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵

```

</details>

*Pusher: @nigelhamer, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Foundation Workflow`*